Repository: mozilla-l10n/mt-training-data
Catalog: gig/gig_pontoon.tmx
Source language: en_us
Languages: gig

source: The giant dinosaurs of the Triassi-.
gig: ٿرائسي رو موٿو دائيناسور

source: The giant dinosaurs of the Triassic.
gig: ٿرائيسڪ دوري ري موٺي دائنورسور

source: The giant dinosaurs of the Triassic. [read by one voice]
gig: ٿرائيسڪ ري موٿي دائيناسور هيتي ايڪ۔ آوآزي سون پڙو

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
gig: ٽراسيڪ ري موتي ڌائينو سور تو موٽي آوازي مين پڙهو

source: The giant dinosaurs of the Triassic. Yes.
gig: ٿرائيسڪ ري موٿي دائيناسور هيتي

source: The giant dino <strong>[cough]</strong> the Triassic.
gig: ٿرائيسڪ رو موٿو ڌائنو ڪنگھ

source: The MediaRecorder API is not supported in your browser.
gig: تمآري برآئوزرمين MediaRecorder API سپورٽ ڪيۮوڙآ ڪوني ۔

source: The number of recordings and which languages you contribute to will be public.
gig: ريڪآڊنگ رو تهدآد آئين جي مينٚ ٻوٚليٚ مينٚ تم هيسو لي سڪونٚ ڇو او آوآمي هوئي ۔

source: The page you are looking for could not be found
gig: جيڪو پنآ تم ڊونڊ ري ڇو او ڪوني ميل سڪي

source: The question should be answerable in just a couple of sentences.
gig: سوآل ليرو جوآب سرڦ ڌي جملي مين ڏيڻو کپي،

source: There are currently no prompts for this language. Please refresh the page or try again later.
gig: اي ٻولي سآرو ڦي لآل ڪوئي بي ايشآرو ڪوني ڇي مهربآني ڪرين پنآ ني تآزو ڪرو يآ پڇي وڙي ڪوشش ڪرو۔

source: There are currently no sentences to review in this language.
gig: اي ٽيم اي ٻولي مين ڌيکي لآ ڪوئي ڀي جملو ڪوني

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
gig: اي ٻولي ري جآنچي سآرو ڦي لهآل ڪو بي ٽرنسڪرپشن موجود ڪوني ۔ مهربآني ڪرين پنآ پر ريڦريش ڪرو يآ پڇي وڙي ڪوشش ڪرو۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
gig: ٻوٚلي وجونٚ سوچيٚ ر ڪترآئيٚ تريٚڪآ ڇي۔ اسپيچ ريڪگنيشن مآڊلزسلآ ۮيوٚي ڇي۔ توٚ بآهميٚ سمجهيٚ پرۮيآن ۮئو،يآ ڪآئيٚ ايٚري ٻوٚلي ريٚ ڪآمن وآئس ،ريٚ مڪسديٚ سآرو ٻوٚلي وآڙيٚ ڪرين ايڪ ۮوجيٚ نيٚ سمجه سگيٚ ڇي جيڪڏيٚ اوٚ ڪوشش ڪريٚ

source: The recording was too long.
gig: ريڪوڍنگ تمام موٽي هيتي

source: The recording was too quiet.
gig: ريڪوڍنگي رو آوازجآم گھٽ هيتو

source: The recording was too short.
gig: ريڪوڍنگ تمام نيني هيتي

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
gig: اي ٻولي سآرو ٽرآنسڪرئيب ڪري سآرو ڦي لآل ڪو بي آڊيو ڪوني ۔ مهربآني ڪرين پنآ ني ريڦريش ڪرو يآ وڙي پڇي ڪوشش ڪرو

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
gig: مآکزموآد مينٚ ميٚسآل توري پر ڪو بي انگ نآ هوئڻ کپي ڪآ تو او مسلآ پيدآ ڪر سڪي ڇي جۮي اونٚچي وآزي سون پڙو ايڪ انگ پڙي رو تريٚڪو هوآلي پر منهسر ڇي ۔ آئينٚ شآيد ديٽآسيٽ مينٚ مونجھآرو متهآرڦ ڪرآئو ۔ ميسآل تور ،نمبر 2409 سئي توري پر پڙسڪي ڇي ۔ ۮئي چوويس زيرو نو آئينٚ ڌي هزآر چآر سئو نو۔

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
gig: پڙيڙ وچ مين ڪودرتي آواز سونيم آوي تو او آوازين رد ڪر ڌو جڌي آواز وديڪ هووي تو ريڪودنگ ٺوٺ جآوي يا آم تو ري پر جڌي او اتر گھٽ هووي جيڪوتم موآد ليندو ڇي او مآلون آوي ڪي او ڪآئي ڪيرو ڇي

source: The route was unclear.
gig: رستو سئي نآ هيتو

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
gig: او ٻولي اي ٽيم برآدري ري ويب سآئيٽ <localizationGlossaryLink> ترڪي هيٽي ڇي آئين </localizationGlossaryLink> لوڪلآئيزيشن جملي رو <sentenceCollectionGlossaryLink> مجموه سورو ڪري ري</sentenceCollectionGlossaryLink> زرورت ڇي۔

source: The selected file is too large
gig: چونڊوڙي ڦآئيل تمآم موٽي ڇي۔

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
gig: جملو ڪليڪٽر ڪور ڪآمن وآئس پليٽ فارمي سامون جآرو ڇي <writeURL> آٻي تم ڪآمن وآئس پر جملو ليک سڪو ڇو</writeURL> يا تم ايڪ جملو جمح ڪران ڌيک سڪ ڇو <reviewURL>

source: The sentence has a grammatical or spelling error.
gig: جملي مين گيرامري ري يا اسپيلنگي ري گلتي

source: The sentence has disrespectful or offensive language.
gig: جملي مين بي ازتي يا بيڪآر جملآ ڇي

source: The sentence must be grammatically correct.
gig: جملو گرمري لييازي سون سئي هوئڻ کپي

source: The sentence must be speakable.
gig: جملو ٻولي جسو هوئڻ کپي

source: The sentence must be spelled correctly.
gig: جملآ سئي لکڻ کپي

source: The sentence should have fewer than 15 words.
gig: جملي مينٚ 15 لڦزي سونٚ گھٽ هوئڻ کپي

source: The site is ready to be launched when it reaches 75% completion.
gig: سآئيٽ سُورو هوٚئي سآرو تيآر ڇي جۮيٚ اوٚ 75 سيڪڙو مڪمل هووٚي۔

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
gig: سآئيٽ جلديٚ سونٚ جلديٚ سورو ڪرڻيٚ ڇي، تآزيٚ مهآلومآتي سآرومهربآنيٚ ڪرو ،<matrixLink> برآدريٚ مينٚ Matrix وآت وگتي</matrixLink> بهڙو هوڻو يآ<githubLink>يآ <discourseLink> GitHubهمآري ڊسڪورس </githubLink>ڦآرمز</discourseLink>پر جآئو ،جيٚ يونٚ سآئيٽ ريٚ تجربي ري مسلي نيٚ جمآ ڪرآئو،آئينٚ ونورو کيآل ڪرسڪي۔

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
gig: ويب سآئيٽي پر موجودTED آڊيو ٻوٚليٚ مينٚ ٺآيو گيٚيو آئينٚ TED-LIUM corpusٽرآنسڪرشن

source: The website text is translated into that language.
gig: ويب سائڊ رو مواد آپيري ٻولي ميٚن بدلو

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
gig: اي موآدي مين ڪي منکي ري اوڙکآڻي سون ميلوڙي زآتي توري پر اوڙکآڻ لآئڪ مهلومآت بهڙو ڇي ۔ جسوڪي او رو نآم ، اي ميل پتو ، مڪآم ، اوڙکي ري نمبر ، ڦون نمبر۔

source: This content is asking for personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
gig: اي موآد مين ڪي منکي ري اوڙکآڻي سون ميلوڙي زآتي توري پر اوڙکآڻ ڪيۮوڙي مهلومآتي سآرو ٻوج ري ڇي ۔جسوڪي او رو نآم ، اي ميل پتو ، مڪآم ۔ اوڙکي ري نمبر ، يآ ڦون نمبر۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
gig: اي جآڻ ڏيڻو جآئز ڇي تم ني او شڪلي مين سامل ڪري ڇي جڏي تم آرام ڪروجيڪڏهن تم ڍيٽاسيٽ ڪرو ڇو هم سب زاتي مآلومآت ني مآنآ ڇآن ائين پڪ ڪران ڇآن ڪي تمآرو نآم تمآري اي ميل جسي مآلومآت اومر يا او اسي ڍيموگرافڪ سون ميلوڙي ڪوني ڇي

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
gig: اي مهلومآت ليڻي موڪل ڇي ، تمني سرڦ او سورتي مين بهڙو ڪرڻو کپي ، جۮي تم آرآمده مهسوس ڪرو ۔ جۮي هم ڊيٽآ سيٽ جآري ڪرآن ڇآن ، هم سبوني زآتي مهلومآتي ري ايشآرو ڏوآن ڇآن آئين پڪ ڪرآن ڇآن ڪي تمآرو نآم آئين اي ميلي اسي مهلومآت آومر يآ جنس جسي ڊيموگرآڦڪ مهلومآتي سون ميلوڙي ڪوني ڇي ،ٽيڪنولآجي هر ڪي سآرو سٺو ڪآم ڪري سآرو ڊيٽآ جيڪو ڊولپرز ني ٽيڪنولآجي ٺآئي مين مدد ڪري ڇي ،اوني منکي ري ايڪ سئي رينجي ني زآهر ڪري ري زرورت ڇي ۔وڌيڪ جآڻو تو ميٽآ ڊيٽآ ڪآ اهم ڇي ۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
gig: اي ايڪ استهمآل ڪيس چلآئي وآڙو هيسو ڇي جي مينٚ ڊيٽآ سيٽ بهڙو ڇي تآڪت ٻوٚليٚ وآڙي انگ اکري ريٚ اوڙکآڻ آئين هآ ،نآ ڊونٚڊڻو

source: This is how you cite yourself if you wrote the content yourself.
gig: جيڪۮي تم موآد آپ ليکيي ڇو تو تم آپير آپ ڪي يونٚ بييآن ڪيۮي ڇو

source: This project would not be possible without people like you. 🎉 There are many ways to get involved with Common Voice - you don't have to know how to code to contribute!
gig: اي منسوبو تمآ جسي منکي سون ايلآوآ ممڪين ڪوني 🎉ڪآمن وآئس سون بهڙي هوئي ري ڪترآئي تريڪآ ڇي ۔تم ني هيسو لي سآرو ڪوڊنگ ڪري ري زرورت ڪوني۔

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
gig: ايٚ سيٽنگ تمآري ليٚڊر بورڊ ريٚ نمآئشي نيٚ ڪنٽرول ڪري ڇي۔جۮي لوڪآ ليٚوي،تمآريٚ ترڪيٚ آپيريٚ ڇي،اوٚ رومتلب ڇي۔ تم رو ڦوٽو ،منکيٚ رو نآم آئينٚ ترڪيٚ ليوي ڇي۔ بدلين ڀري مينٚ { $minutes } ليڊر بورڊ نيٚ زآهر ڪونيٚ هووي نوٽ ڪرو ليڊر بورڊ ريڦريش

source: Three to go!
gig: ٽي جآئي سآرو

source: Thur
gig: ٿوٚر

source: Tibetan
gig: تبتيٚ ٻوٚلي

source: Tigre
gig: ٽيگريٚ

source: Tigrinya
gig: ٽگرنيآ

source: Tlazoyaltepec Mixtec
gig: ٽيٚلآزوئل ٽيٚپيٚڪ ميڪسٽيٚڪ

source: Toba Qom
gig: توبآ ڪوم

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
gig: آپيري اي ميلي ني بدلي ڪرو يآ ايڊت ڪري سآرو هم ني <emailFragment>commonvoice@mozilla.com</emailFragment> او پر اي ميلو

source: Today
gig: آج

source: Today's Common Voice progress on clips recorded
gig: ريٚڪوڊنگ هووڙيٚ ڪلپس نيٚ آجي ريٚ آم آوآزي ريٚ زير زٻر

source: Today's Common Voice progress on clips validated
gig: ڪلپس پرآج آم آوآزپيش زٻر هووڙي ڇي

source: Today's Progress
gig: آجوڪو پيش رڦت

source: Toki Pona
gig: ٽوڪيٚ پونآ

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
gig: ڪآمن وآئيس ڊيٽآ سيٽ مين بهڙي هوئي سارو وآئيس ڪلپ ني دي الگ استهمال ڪري ر ترڦي سون سئي هوئڻ کپي ۔

source: Too many files
gig: جآم گھڻي فائلي

source: Top Contributors
gig: وڌيٚڪ هيٚسوليوآڙي

source: Torwali
gig: ٽوروآليٚ

source: Total
gig: سب

source: Total Approved
gig: سئيٚ تريٚڪيٚ سونٚ موڪل ميلوڙي

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
gig: سآجي پآسي هم ڦآئيٚدي ريٚ ليٚسٽ بيٚيآن ڪر ريٚ ڇآنٚ آئينٚ هم زآر ڪر ريٚ ڇآنٚ ڪي هم ڪسي مهلومآتيٚ نيٚ آوآمي ڪرآنٚ ڇآنٚ آپيرڊوآئيٚس پر ايڪ ڪآمن وآئيس کآتي سونٚ سورو ڪري سآروهيٽي وآڙيٚ لنڪ استهمآل ڪرو۔

source: Toward next goal
gig: آئيوآڙي مڪسدي ري سآمونٚ

source: Track progress here and on your stats page.
gig: آٺي آئينٚ تمآريٚ انٚگيم آکريم وآڙي پنآ پر پيش زٻر نيٚ نشآن ڪرو،

source: Transcribe
gig: لکوڙآ

source: Transcribe answers
gig: جوآبي ني نڪل ڪرو

source: Transcribe Audio
gig: آڊيو نڪل ڪرو

source: Transcribe audio recordings into text
gig: آڍيو ريڪوڍنگي ني ٽيڪسٽ نڪل ڪرو

source: Transcribe audio recordings in your language
gig: آپيري ٻولي مين آڌيو ريڪوڍنگ نڪل ڪرو

source: Transcribe Audio <small>(Coming soon)</small>
gig: جلدي آرو ڇي <small>نڪلي رو جآئزو

source: Transcript edited successfully
gig: ٽرآسڪرپٽ ڪآميآبي سون ايڊٽ ڪيويو گيو۔

source: Transcript skipped successfully
gig: ٽرآنسڪرپٽ ڪآميآبي سون ڇوڙ ڪآڙيو

source: Transcript submitted successfully
gig: ٽرآسڪرپٽ ڪآميآبي سون ايڊٽ ڪيويو گيو۔

source: Transcript voted successfully
gig: ٽرنسڪرپٽ ڪآميآبي سون ووٽ ڪرو ۔

source: Transgender
gig: کڌڙآ

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
gig: Pontoon نيٚ ڪي يون استهمآل ڪري <translateVideoLink> همآري گآئيڊ ۮيکو</translateVideoLink>

source: Translating the site
gig: سآئيٽ رو ترجمو

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
gig: ترجمونٚ انگريزي مينٚ ڇي، پر تم ۮيٚک سڪوٚ ڇولئڪن </strong> پروئيل <strong>ۮوجيٚ ٻوٚلي مينٚ ڪلڪ ڪرو </strong> تجويزون <strong> لنڪ آئين بهڙو ڪرو جۮيٚ ڀيٚ ٻوٚلي تم ٻوٚلو ڇو تري سآڃو هآت </strong> سيٽنگون <strong> پڇي ٻوٚلآيو جآوٚي ڇي۔ </strong> <strong> ڪنڊيٚ مينٚ ترجمي ريٚ ايڪ ڦهرست هووٚي Localesجينيٚ ترجمونٚ ايڪ ۮنيٚ سونٚ پڇي سآئيٽ پر ۮيکآوٚي ڇي۔

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
gig: سآئيٽ روٚ ترجمونٚ Common Voice پر هووي ڇي<strong>Pontoon</strong>

source: Try again by dragging your file here
gig: تمآري فائل ڇيڪين ڌوبارا ڪوشش ڪرو

source: Try uploading again
gig: ڌوبارا اپلوڏ ڪري ري ڪوشش ڪرو

source: Tshivenda
gig: شيويٚنڊآ

source: Tunen
gig: تيٚنيٚن

source: Tupuri
gig: توپوريٚ

source: Turkish
gig: ترڪيٚ

source: Turkmen
gig: ترڪمآنيٚ

source: Tush
gig: توٚس

source: Tuvan
gig: تووآن

source: Twi
gig: ٽوئيٚ

source: Typically megabytes
gig: آم ميگآ بآئيٽس

source: Ubykh
gig: آوبيٚک

source: Udmurt
gig: آدمورت

source: Ukrainian
gig: يوڪريٚنيٚ

source: Understand contribution criteria
gig: ڪير اهميتين سهمجو

source: Understand how to contribute and validate on the Common Voice dataset
gig: سمجھو تو ڪآمن وآئس ڊيٽآ سيٽ مينٚ جملو آئينٚ آڊيو ڪلپس ني ڪي يونٚ تآون آئينٚ پڪ ڪرآن

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
gig: سمجهو تو وآئس ڪلپس سوڻيڻ ٿيم ڪآئي ڌيکڻو کپي ائين آپيري وآئس رڪآرڌينگ ني وڌيڪ امير ڪري سآرو مدد ڪرو

source: Universities, Academics and Researchers
gig: يونيورسٽي ،تهليمي آئين مهڪڪ

source: Upload aborted. Do you want to delete your recordings?
gig: اپلوڍ بند ڪروڙا ڇي ڪآئي تم آپيري ريڪوڍنگ کتم ڪرڻو چآئو ڇو

source: Upload an image file
gig: ايڪ ڦوٽو ڦآئيل اپ لوڊ ڪرو

source: { $uploadedQuestions } of { $totalQuestions } questions collected
gig: مين { $uploadedSentences } جملآ ڀيڙي ڪيڌو ڇون{ $totalSentences }

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
gig: پنآ ڏيکو ڏوجھو۔{ $uploadedQuestions }{ $totalQuestions } سوآلي مين بهڙي ڪيۮو گيو ۔ سوآل بهڙي ڪري بآبت وڌيڪ سيکي سآرو همآري <guidelinesLink></guidelinesLink>

source: { $uploadedSentences } of { $totalSentences } sentences collected
gig: مين { $uploadedSentences } جملآ ڀيڙي ڪيڌو ڇون{ $totalSentences }

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
gig: اٺي { $totalSentences } ڪليڪ ڪرو { $totalSentences }ڌوجھو جمآ ڪيڌوڙا<downloadLink> رد هووڙا جملآن ڌآئولڌ ڪري سارو</downloadLink>آٺي تم ڪليڪ ڪرو

source: Upload failed, please retry.
gig: اپلوڍ نا ڪآم هوگيو ڌوبارا ڪوشش ڪر

source: Upload <icon></icon> public domain sentences
gig: آوامي جملآ ڍومين اپلوڍ <icon></icon>ڪرو

source: Upload in progress...
gig: اپلوڍ چآلو ڇي

source: Upload more sentences?
gig: وڍيڪ جملآ اپلوڍ ڪرو

source: Upload of this clip keeps failing at server. Reload the page or try again later.
gig: اي ڪلپي ريٚ اپلوڊ اوپرنآڪآم هوريٚ ڇي،پنآ نيٚ ۮوبآره لوڊ ڪرو، يآ پڇي مينٚ دوبآره ڪوشش ڪرونٚ

source: Upload of this clip keeps failing, keep retrying?
gig: اي ڪلپي ريٚ اپلوڊ نآڪآم هوريٚ ڇي،ۮوبآره ڪوشش ڪرو

source: Urdu
gig: اُڙدو

source: Use correct grammar
gig: سئي گرآمر استهمال ڪرو

source: Use correct spelling and grammar
gig: سئي اسپيلنگ آئين گرآمر استهمآل ڪرو ،

source: Use correct spelling and grammar.
gig: سئي اسپيلنگ آئين گرآمر استهمآل ڪرو ،

source: Use correct spelling and punctuation
gig: سئي اسپيل ائين زير زبر استهمال ڪرو

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
gig: <mark> نميآتي تڪريري ري هوآلي سون </mark> آئين ڪيسن ري استهمآل سآرو مڦيد ميسآل تور ،جۮي تم چآئو ڇو تو تڪرير ري اوڙکآڻ گير اسڪرپٽ هووڙي آئين آم ٻولي ٻوليوآڙي منکون سون ڪآم ڪري۔

source: User Name
gig: استمآل ڪري وآڙي رو نآم

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
gig: استهمآل ڪيۮو ڙي ڏي دو ڙي ڪلپس چيڪ ڪرڻي ڇي چيڪ ڪري ڇي ڪي اسپيڪر اوني جملي ني سئي پڙي ڇي۔

source: Ushojo
gig: اوسوجو

source: Uyghur
gig: ويٚگر

source: Uzbek
gig: آزيٚڪ

source: Validated Clips
gig: سئيٚ هوڙآ ڪلپس

source: Validated Hours
gig: پڪو هووڙآ ڪلآڪ

source: Validated Hr. Total
gig: پڪي هوڙآ سب ڪلآڪ

source: Validate readings
gig: پڙي ري ڪوشش ڪرو

source: Validate Readings
gig: پڙي ري ڪوشش ڪرو

source: Validate Readings, Review Transcriptions
gig: پڙي ري ڪوشش ڪرو ڪآپي ري مدد لئو

source: Validate Readings <small>(Coming soon)</small>
gig: پڙي ري ڪوشش ڪرو<small>جلدي آ رو ڇي</small>

source: Validate readings submitted by community members
gig: برادري ري ميمبري سوڻ ليدوڙي پڙآئي مين سمجه رآکو

source: Validate user-recorded readings in your language
gig: تمآري ٻولي مين استهمآل هو وڙي رڪآرد پڙآئي ري مددي سون فائدو کڻو

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
gig: ڌآن ڪيٚۮوڙآ ڪلپي ني سئي ڪرڻو آم آوآزي ريٚ ميشينيني سآرو بي زروري ڇي ۔ سوڻو آئينٚ همآري مدد ڪرو مهيآري اوپين سورس وآئس ڊيٽآ ٺآئي مينٚ ۔

source: Validation Progress
gig: سئي ري جير جٻر

source: Validations
gig: ڌيٚ سئيٚ ڪرڻو

source: Value and recognition.
gig: ڪدر آئينٚ اوٚڙکآڻ

source: Variant Contribution Options
gig: مکتليڦ تهآوني ري پآبندي

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
gig: ايڪ ٻولي جيڪو ايڪ مکسوس روپ ڇي ۔ ميسآل تور جيڪو جگرآڦيآئي يآ برآدري مين رهي وآڙي ترڦو ويرآوي ڇي ۔ ڪيۮي ڪيۮي او وآتي بي ٻولآوي ڇي ۔

source: Varying Pronunciations
gig: آلگ آلگ لفز

source: Venetian
gig: ويٚنيٚٿيٚن

source: Version
gig: نئيٚ چيٚز

source: Very common mistakes include:
gig: تمآم آم گلتيٚيي شآمل ڇي

source: Vietnamese
gig: ويٚٽنآميٚ

source: View your progress against personal and project goals.
gig: زآتي آئينٚ منسوبآ ريٚ مڪسدي ريٚ کيٚلآڦ تمآريٚ جيٚر جٻر ۮيکو

source: Visible
gig: زآهر

source: Voice clips are entered into a submission queue that readies them for listening.
gig: وآئيس ڪلپس جمح ڪروڙي لين مين ميل ڌو۔جيڪو اوني سوڻو سارو تيآر ڪري

source: Voice Collection
gig: آوآزي رو بهڙو هوڻو

source: Voice Contribution
gig: آپيري آواز ڏيڻو

source: Voice Dataset, Ready for Download
gig: وآئيٚس ڊيٽآ سيٚٽ ڊآئونٚ لوڊ سآرو تيآر

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
gig: آوآز کدرتي ڇي ، آوآز انسآني ڇي ايٚ وجونٚ همني کآبل استهمآل آوآز ٺآئي ريٚ دلچشبي ڇي۔ همآري ميشيني سآرو تيڪنآلآجي ۔پر آوآز سسٽم ٺآئي سآرو آوآزي ري ايڪ تمآم موٽو مکدآر ڊيٽآ ريٚ زرورت ڇي۔

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
gig: آوآز کدرتي ڇي ، آوآز انسآني ڇي ايٚ وجونٚ همني کآبل استهمآل آوآز ٺآئي ريٚ دلچشبي ڇي۔ همآري ميشيني سآرو تيڪنآلآجي ۔پر آوآز سسٽم ٺآئي سآرو آوآزي ري ايڪ تمآم موٽو مکدآر ڊيٽآ ريٚ زرورت ڇي۔

source: Voices Online Now
gig: آوآز آن لآئن اٻي

source: Voice Validation
gig: آواز اوڙکڻو

source: Volume
gig: جآم

source: Votic
gig: ووٽڪ

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
gig: اوني ڦري آئينٚ کولوڙآ سورس تڪرير اوڙکآڻ انجڻ سونٚ استهمآل ڪري سآرو نڪل ڪيٚڌوڙآ تڪريٚر بهڙو VoxForge ڪري سآرو ٺآيو گيٚيو ڇي۔

source: Wakhi
gig: وآڪي

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
gig: آم آوآزيٚ نيٚ ڀي سٺو ٽآئيم مدد ڪرڻوٚچآهونٚ ڇونٚ</discourseLink>ڊيس ڪورس<discourseLink>گيٽ هڀ</githubLink> زبردست اي ميل زريهيٚ رآبتو ڪرڻوٚ يآ زريهيٚ جمح ڪرو،يآ بهڙو ڦورمز،سائيٽ ريٚ مسليٚ نيٚ هويوٚ۔برآدريٚ ٻول چآل </matrixLink> ميٽريس </matrixLink>۔

source: Want to save your information? <createProfile>Create a profile</createProfile>
gig: ڪآئي تم آپيري وآتي لوڪآڻو چآئو ڇو<createProfile> پيرو فائل ٺآيو</createProfile>

source: Want to stay in touch with Common Voice?
gig: ڪآمن وآئيسي سون رابتي مين رهڻو چآئو ڇو۔

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
gig: تآزآ ڪآري چآوآنٚ ڇآنٚ ۔ جۮي هم ڪآمن وآئس ڊيٽآ سيٽ رو نئونٚ نڪسو تيٚتآر ڪرو ،همآريٚ نيوز ليٽري ريٚ آلگ ريٚت هآسل ڪرو

source: Watch our video explainer to help
gig: مدد سآرو همآرو وڊيو سمجهآئي ڪيٚکر ۮيٚکو۔

source: Wayuunaiki
gig: وآئينيٚڪيٚ

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
gig: هم هميشآ ڊيٽآ منکون سون انوري زرورت آئين هوآلي سون سوڻي ري ڪوشش ڪرآن ڇآن ۔ڊيٽآ بهڙي هوئيوآڙي پليٽ ڦآرمي پر تهآون ڪري سون لين ڊيٽآ ري سهت ري بسرت ميهآ ڪري تآئين ، هم چآوآن ڇآن تو </emailFragment> تمآ سون سوڻڻو <emailFragment>

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
gig: هم آوآزي رو ايڪ کولوڙآ ائينٚ آوآمي توري پر موجود ڊيٽآسيٽ ٺآ ريٚ ڇآنٚ جي ني هر ايڪ استهمآل ڪر سڪي ڇِي ۔تڪرير ،ڦهآل هووڙآ اپيليٚڪيش ني تربيت ۮي سآرو

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
gig: هم ٽيڪنولآجي ،جدت آئين ٻولي ري هڪي مين آوآمي شهبي ري مسروڦيت ري همآيت ڪري سآرو پر جوش هووي ،جيڪو تم ايڪ موٽي پروجيڪٽ يآ مهم چلآئي ري رٿآ بندي ڪر ري ڇو ، مهربآني ڪرين ڪرو </emailFragment> رآپتي مين آئو۔<emailFragment>

source: We are going out to get a coffee.
gig: هم چآنئي پيئن ڀآري جآري ڇآن

source: We are going out to get coffee.
gig: هم چآنه پيئي سآرو ڀآري جآري ڇآن

source: We are offering more options to give people more choice in what they tell us about their sex or gender identity. Please self-describe in the way that feels most natural to you. <learnMoreLink>Learn more about our approach to sex and gender.</learnMoreLink>
gig: هم منکي ني وڌيڪ سولت ڏي رهي ڇآن تو جي يو او آپيري جنس يآ سنڦي اوڙکي ري بآري مين ڪآئي سوڻآوي مهربآني ڪرين آپي ني اسي تريڪي سون بيآن ڪرو ۔ جيڪو تمني سبون سون وڌيڪ ڪودرتي لآگي<learnMoreLink> جنس آئين جنس همآري تريڪي ري بآري مين وڌيڪ سيکي</learnMoreLink>۔

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
gig: پر آوآز ٽيڪنولآجي ري چوڌآريٚ Mozillaايڪ برآدريٚ هم جوڙ ريٚ ڇآنٚ ۔هم تآزآ ڪرين ،نئي ڊيٽآ ريٚ زريي سونٚ رآبتي مينٚ رهڻو چآوآنٚ ڇآنٚ آئينٚ وڌيڪ سوڻيٚ سآرو تو تم ائين ڊيٽآ نيٚ ڪيٚ يونٚ استهمآل ڪر رئي ڇو۔
